app/views/posts/show.html.erb

  <div id="comments">
    <h2><%= @post.comments.count %> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]